{
    "plant_name": "Tomato",
    "climate_zone": "Australia - temperate",
    "alternate_names": [
        "Lycopersicon esculentum"
    ],
    "planting_calendar": {
        "Jan": "S",
        "Feb": "",
        "Mar": "",
        "Apr": "",
        "May": "",
        "Jun": "",
        "Jul": "",
        "Aug": "S",
        "Sep": "S",
        "Oct": "S",
        "Nov": "S",
        "Dec": "S"
    },
    "planting_methods": {
        "S": "Plant undercover in seed trays",
        "T": "Plant out (transplant) seedlings",
        "P": "Sow seed"
    },
    "growing_info": {
        "soil_temp": "Best planted at soil temperatures between 16°C and 35°C.",
        "spacing": "- Space plants: 40 - 60 cm apart",
        "harvest_time": "- Harvest in 8-17 weeks."
    },
    "companion_planting": {
        "compatible_with": [
            "-  Asparagus",
            "Chervil",
            "Carrot",
            "Celery",
            "Chives",
            "Parsley",
            "Marigold",
            "Basil"
        ],
        "avoid_growing_close_to": [
            "-  Rosemary",
            "Potatoes",
            "Fennel",
            "Cucumber"
        ]
    },
    "growing_notes": [
        "There is nothing like the taste of a freshly picked tomato, warm from the sunshine. In the smallest of gardens or even an apartment with a window-box, it is worth growing at least one tomato plant for the pleasure it will give you. They will grow in pots, troughs or even hanging baskets.",
        "Tomatoes should be grown in shelter or under cover in cool climates.",
        "Tomatoes like lots of food! In a garden bed, compost and mulching will produce a crop from one or two plants. In containers, use some suitable long term fertiliser pellets or feed regularly when you water. Feeding improves the flavour of the fruit.",
        "When you plant out, put the seedlings in a deep holes, up to the top set of leaves. The covered stems will put out extra roots and you will have a stronger, healthier plant.",
        "There are many different varieties of tomatoes but they all have one of two growth habits.",
        "Compact bush growth, stops at a specific height and useful for containers. If left without supporting stakes, they will form a dense carpet which excludes weeds and keeps the soil cool and damp.",
        "Will continue growing a main stem, or vine until stopped by frost. The majority of heirloom tomatoes are indeterminate.",
        "Both types need stakes to give them some support otherwise they will sprawl across the garden.",
        "Varieties include Acid-free, Bush, Tall, Cherry, Yellow and many others."
    ],
    "culinary_hints": [
        "- cooking and eating Tomato",
        "Use in sauces, with fried meals, in sandwiches. Can be frozen whole or in pieces."
    ]
}